# IATFTranslationServer Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
IATFTranslationServer Interface
Members See Also
---
Interface class for external servers implementing ATF translation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public interface IATFTranslationServer : IExternalServer
```

Visual Basic
---
```text
Public Interface IATFTranslationServer _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class IATFTranslationServer : IExternalServer
```

# Remarks
A typical way to use the external server can be:
  * Implement a server class that derives from this interface
  * Create a new server object and register it with the service, see ExternalServiceRegistry.

# See Also
IATFTranslationServer Members
Autodesk.Revit.DB Namespace